{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<sos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<sos>": 1,
      "<eos>": 2,
      "<unk>": 3,
      "!": 4,
      "\"": 5,
      "#": 6,
      "$": 7,
      "%": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "0": 19,
      "1": 20,
      "2": 21,
      "3": 22,
      "4": 23,
      "5": 24,
      "6": 25,
      "7": 26,
      "8": 27,
      "9": 28,
      ":": 29,
      ";": 30,
      "<": 31,
      "=": 32,
      ">": 33,
      "?": 34,
      "@": 35,
      "A": 36,
      "B": 37,
      "C": 38,
      "D": 39,
      "E": 40,
      "F": 41,
      "G": 42,
      "H": 43,
      "I": 44,
      "J": 45,
      "K": 46,
      "L": 47,
      "M": 48,
      "N": 49,
      "O": 50,
      "P": 51,
      "Q": 52,
      "R": 53,
      "S": 54,
      "T": 55,
      "U": 56,
      "V": 57,
      "W": 58,
      "X": 59,
      "Y": 60,
      "Z": 61,
      "[": 62,
      "\\": 63,
      "]": 64,
      "^": 65,
      "_": 66,
      "`": 67,
      "a": 68,
      "b": 69,
      "c": 70,
      "d": 71,
      "e": 72,
      "f": 73,
      "g": 74,
      "h": 75,
      "i": 76,
      "j": 77,
      "k": 78,
      "l": 79,
      "m": 80,
      "n": 81,
      "o": 82,
      "p": 83,
      "q": 84,
      "r": 85,
      "s": 86,
      "t": 87,
      "u": 88,
      "v": 89,
      "w": 90,
      "x": 91,
      "y": 92,
      "z": 93,
      "{": 94,
      "|": 95,
      "}": 96,
      "~": 97,
      "è": 98,
      "in": 99,
      "int": 100,
      "re": 101,
      "an": 102,
      "if": 103,
      "to": 104,
      "se": 105,
      "en": 106,
      "or": 107,
      "on": 108,
      "<<": 109,
      "le": 110,
      "for": 111,
      "th": 112,
      "er": 113,
      "ong": 114,
      "rea": 115,
      "long": 116,
      "is": 117,
      "ou": 118,
      ">>": 119,
      "si": 120,
      "ar": 121,
      "st": 122,
      "cou": 123,
      "++": 124,
      "pr": 125,
      "and": 126,
      "lse": 127,
      "print": 128,
      "ma": 129,
      "eg": 130,
      "cl": 131,
      "else": 132,
      "integ": 133,
      "integer": 134,
      "cout": 135,
      "read": 136,
      "um": 137,
      "ve": 138,
      "00": 139,
      "()": 140,
      "ans": 141,
      "ur": 142,
      "al": 143,
      "cin": 144,
      "of": 145,
      "end": 146,
      "==": 147,
      "ret": 148,
      "urn": 149,
      "return": 150,
      "let": 151,
      "ent": 152,
      "++)": 153,
      "endl": 154,
      "clu": 155,
      "sive": 156,
      "clusive": 157,
      "set": 158,
      "ing": 159,
      "ment": 160,
      "str": 161,
      "de": 162,
      "wi": 163,
      "arr": 164,
      "with": 165,
      "][": 166,
      "nt": 167,
      "cre": 168,
      ");": 169,
      "crement": 170,
      "ex": 171,
      "];": 172,
      "ch": 173,
      "sum": 174,
      "main": 175,
      "ue": 176,
      "exclusive": 177,
      "ne": 178,
      "new": 179,
      "hi": 180,
      "ze": 181,
      "increment": 182,
      "size": 183,
      "string": 184,
      "lo": 185,
      "whi": 186,
      "ine": 187,
      "--": 188,
      "while": 189,
      "qu": 190,
      "max": 191,
      "qual": 192,
      "equal": 193,
      "line": 194,
      "the": 195,
      "are": 196,
      "mp": 197,
      "10": 198,
      "than": 199,
      "<=": 200,
      "by": 201,
      "ter": 202,
      "++;": 203,
      "decl": 204,
      "declare": 205,
      "ay": 206,
      "te": 207,
      "min": 208,
      "ro": 209,
      "con": 210,
      "len": 211,
      "integers": 212,
      "cnt": 213,
      "val": 214,
      "ol": 215,
      "array": 216,
      "pu": 217,
      "ab": 218,
      "100": 219,
      "+=": 220,
      "rom": 221,
      "be": 222,
      "from": 223,
      "res": 224,
      "ti": 225,
      "value": 226,
      "la": 227,
      "tr": 228,
      "char": 229,
      "&&": 230,
      "..": 231,
      "num": 232,
      "])": 233,
      "op": 234,
      "mo": 235,
      "ss": 236,
      "newline": 237,
      "count": 238,
      "\";": 239,
      "no": 240,
      "as": 241,
      "ac": 242,
      "inclusive": 243,
      "me": 244,
      "put": 245,
      "fla": 246,
      "loop": 247,
      "#.": 248,
      "flag": 249,
      "grea": 250,
      "greater": 251,
      "true": 252,
      "reak": 253,
      "break": 254,
      "un": 255,
      "ge": 256,
      "leng": 257,
      "length": 258,
      "],": 259,
      "mod": 260,
      "')": 261,
      "temp": 262,
      "less": 263,
      "!=": 264,
      "const": 265,
      "NO": 266,
      "#.#.": 267,
      "bo": 268,
      "fa": 269,
      "s1": 270,
      "tion": 271,
      "not": 272,
      "();": 273,
      "ES": 274,
      "id": 275,
      "YES": 276,
      "it": 277,
      "po": 278,
      "vec": 279,
      "abs": 280,
      "at": 281,
      "tor": 282,
      "crea": 283,
      "ad": 284,
      "----": 285,
      "decrement": 286,
      "s2": 287,
      ">=": 288,
      "crease": 289,
      "then": 290,
      "input": 291,
      "0000": 292,
      "able": 293,
      "false": 294,
      "fun": 295,
      "sh": 296,
      "var": 297,
      "ction": 298,
      "ele": 299,
      "sig": 300,
      "function": 301,
      "vari": 302,
      "variable": 303,
      "....": 304,
      "vector": 305,
      "do": 306,
      "((": 307,
      "element": 308,
      "';": 309,
      "))": 310,
      "ul": 311,
      "sor": 312,
      "arg": 313,
      "sign": 314,
      "dp": 315,
      "ir": 316,
      "low": 317,
      "\"\\": 318,
      "ange": 319,
      "increase": 320,
      "ument": 321,
      "argument": 322,
      "add": 323,
      "||": 324,
      "assign": 325,
      "ap": 326,
      "change": 327,
      "sort": 328,
      "bool": 329,
      "1e": 330,
      "acter": 331,
      "ck": 332,
      "character": 333,
      "tmp": 334,
      "modu": 335,
      "modulo": 336,
      "3f": 337,
      "x1": 338,
      "cd": 339,
      "push": 340,
      "co": 341,
      "ce": 342,
      "cont": 343,
      "ult": 344,
      "99": 345,
      "out": 346,
      "gcd": 347,
      "'\\": 348,
      "ke": 349,
      "cur": 350,
      "cal": 351,
      "maxn": 352,
      "im": 353,
      "one": 354,
      "IN": 355,
      "mx": 356,
      "--;": 357,
      "result": 358,
      "--)": 359,
      "ime": 360,
      "fol": 361,
      "follow": 362,
      "ack": 363,
      "following": 364,
      "ed": 365,
      "tot": 366,
      "irst": 367,
      "get": 368,
      "\",": 369,
      "x2": 370,
      "ta": 371,
      "10000": 372,
      "ant": 373,
      "ser": 374,
      "vo": 375,
      "su": 376,
      "star": 377,
      "back": 378,
      "t1": 379,
      "MA": 380,
      "#.#.#.#.": 381,
      "vis": 382,
      "MAX": 383,
      "di": 384,
      "pos": 385,
      "3f3f": 386,
      "first": 387,
      "start": 388,
      "]);": 389,
      "che": 390,
      "--------": 391,
      "-=": 392,
      "elements": 393,
      "beg": 394,
      "begin": 395,
      "mn": 396,
      "constant": 397,
      "ints": 398,
      "c1": 399,
      "arguments": 400,
      "into": 401,
      "map": 402,
      "1000": 403,
      "output": 404,
      "ind": 405,
      "cond": 406,
      "ard": 407,
      "imum": 408,
      "y1": 409,
      "void": 410,
      "pre": 411,
      "ame": 412,
      "_back": 413,
      "t2": 414,
      "push_back": 415,
      "]]": 416,
      "',": 417,
      "1000000": 418,
      "inue": 419,
      "OO": 420,
      "continue": 421,
      "boo": 422,
      "y2": 423,
      "),": 424,
      "prime": 425,
      "........": 426,
      "gh": 427,
      "mid": 428,
      "check": 429,
      "incrementing": 430,
      "il": 431,
      "ri": 432,
      "inde": 433,
      "sub": 434,
      "second": 435,
      "105": 436,
      "));": 437,
      "ble": 438,
      "inser": 439,
      "c2": 440,
      "\")": 441,
      "insert": 442,
      "strings": 443,
      "20": 444,
      "1e9": 445,
      "index": 446,
      "now": 447,
      "(),": 448,
      "].": 449,
      "top": 450,
      "dis": 451,
      "v1": 452,
      "boole": 453,
      "equals": 454,
      "total": 455,
      "returning": 456,
      "name": 457,
      "dou": 458,
      "double": 459,
      "sum1": 460,
      "time": 461,
      "(!": 462,
      "sol": 463,
      "run": 464,
      "dif": 465,
      "iter": 466,
      "longs": 467,
      "make": 468,
      "boolean": 469,
      "values": 470,
      ".|": 471,
      "ven": 472,
      "ute": 473,
      "ther": 474,
      "es": 475,
      "ok": 476,
      "};": 477,
      "ca": 478,
      "\"|": 479,
      "100000000": 480,
      "]++;": 481,
      "p1": 482,
      "variables": 483,
      "col": 484,
      "absol": 485,
      "led": 486,
      "absolute": 487,
      "11": 488,
      "pa": 489,
      "stand": 490,
      "standard": 491,
      "wer": 492,
      "ct": 493,
      "sum2": 494,
      "last": 495,
      "a1": 496,
      "call": 497,
      "ber": 498,
      "pl": 499,
      "60": 500,
      "MO": 501,
      "MOD": 502,
      "INF": 503,
      "itera": 504,
      "solve": 505,
      "n1": 506,
      "wise": 507,
      "sizeof": 508,
      "decrease": 509,
      "sw": 510,
      "row": 511,
      "12": 512,
      "move": 513,
      "diff": 514,
      "26": 515,
      "od": 516,
      "101": 517,
      "maxx": 518,
      "that": 519,
      "ha": 520,
      "/=": 521,
      "200": 522,
      "up": 523,
      "find": 524,
      "even": 525,
      "ep": 526,
      "50": 527,
      "swap": 528,
      "vi": 529,
      "']": 530,
      "ght": 531,
      "n2": 532,
      "us": 533,
      "());": 534,
      "ty": 535,
      "p2": 536,
      "ase": 537,
      "called": 538,
      "sp": 539,
      "pend": 540,
      "minimum": 541,
      "inf": 542,
      "ere": 543,
      "bit": 544,
      "def": 545,
      "mem": 546,
      "ft": 547,
      "maximum": 548,
      "9999": 549,
      "ice": 550,
      "number": 551,
      "())": 552,
      "counter": 553,
      "ver": 554,
      "INT": 555,
      "memset": 556,
      "append": 557,
      "define": 558,
      "ord": 559,
      "100000": 560,
      "30": 561,
      "my": 562,
      "ite": 563,
      "(\"": 564,
      "tw": 565,
      "a2": 566,
      "arrays": 567,
      "15": 568,
      "go": 569,
      "all": 570,
      "\"#": 571,
      "left": 572,
      "----------------": 573,
      "ans1": 574,
      "LL": 575,
      "2d": 576,
      "fs": 577,
      "nd": 578,
      "1000000007": 579,
      "returns": 580,
      "stop": 581,
      "xx": 582,
      "v0": 583,
      "el": 584,
      "s3": 585,
      "minn": 586,
      "\");": 587,
      "0x": 588,
      "['": 589,
      "mar": 590,
      "user": 591,
      "ans2": 592,
      "|.|": 593,
      "maxi": 594,
      "MAXN": 595,
      "right": 596,
      "cost": 597,
      "mi": 598,
      "getchar": 599,
      "os": 600,
      "other": 601,
      "3f3f3f3f": 602,
      "odd": 603,
      "mark": 604,
      "inter": 605,
      "ext": 606,
      "ff": 607,
      "LE": 608,
      "characters": 609,
      "Ma": 610,
      "v2": 611,
      "win": 612,
      "110": 613,
      "1005": 614,
      "dfs": 615,
      "act": 616,
      "pair": 617,
      "prev": 618,
      "au": 619,
      "step": 620,
      "dist": 621,
      "\"-": 622,
      "ea": 623,
      "otherwise": 624,
      "day": 625,
      "mini": 626,
      "decrementing": 627,
      "0x3f3f3f3f": 628,
      "tak": 629,
      "INT_": 630,
      "mul": 631,
      "b1": 632,
      "emp": 633,
      ".#.#.#.#.": 634,
      "divi": 635,
      "ron": 636,
      "per": 637,
      "18": 638,
      "divide": 639,
      "next": 640,
      "31": 641,
      "1e5": 642,
      "answer": 643,
      "Yes": 644,
      "que": 645,
      "max_": 646,
      "times": 647,
      "fi": 648,
      "ow": 649,
      "tes": 650,
      "ara": 651,
      "taking": 652,
      "strlen": 653,
      "ned": 654,
      "dat": 655,
      "mm": 656,
      "'.": 657,
      "ount": 658,
      "20000": 659,
      "'#": 660,
      "100005": 661,
      "subtr": 662,
      "puts": 663,
      "signed": 664,
      "ace": 665,
      "iteration": 666,
      "ini": 667,
      "lower": 668,
      "word": 669,
      "pow": 670,
      "d1": 671,
      "No": 672,
      "min_": 673,
      "posi": 674,
      "idx": 675,
      "*=": 676,
      "64": 677,
      "dig": 678,
      "aa": 679,
      "am": 680,
      "pointer": 681,
      "cis": 682,
      "test": 683,
      "ize": 684,
      "pe": 685,
      "INT_MAX": 686,
      "'*": 687,
      ")\"": 688,
      "ate": 689,
      "ound": 690,
      "take": 691,
      "ii": 692,
      "cc": 693,
      "each": 694,
      "_t": 695,
      "cle": 696,
      "tt": 697,
      "mat": 698,
      "np": 699,
      "cnt1": 700,
      "max1": 701,
      "empty": 702,
      "Max": 703,
      "remove": 704,
      "ll": 705,
      "Se": 706,
      "aux": 707,
      "\"+": 708,
      "dy": 709,
      "multi": 710,
      "f1": 711,
      "qr": 712,
      "'-": 713,
      "RI": 714,
      "k1": 715,
      "inline": 716,
      "]))": 717,
      "subtract": 718,
      "curr": 719,
      "substr": 720,
      "d2": 721,
      "rr": 722,
      "rem": 723,
      "nl": 724,
      "unsigned": 725,
      "sa": 726,
      "ero": 727,
      "erase": 728,
      "cast": 729,
      "rest": 730,
      "pro": 731,
      "exit": 732,
      "getline": 733,
      "two": 734,
      "Num": 735,
      "ya": 736,
      "num1": 737,
      "base": 738,
      "ts": 739,
      "bi": 740,
      "price": 741,
      "riend": 742,
      "initi": 743,
      "1001": 744,
      "ud": 745,
      "initial": 746,
      "ka": 747,
      "str1": 748,
      "verse": 749,
      "riends": 750,
      "dx": 751,
      "wn": 752,
      "differe": 753,
      "zero": 754,
      "str2": 755,
      "%=": 756,
      "55": 757,
      "Count": 758,
      "gr": 759,
      "ps": 760,
      "wh": 761,
      "play": 762,
      "Time": 763,
      "An": 764,
      "rent": 765,
      "cnt2": 766,
      "current": 767,
      "24": 768,
      "takes": 769,
      "l1": 770,
      "#.|.|": 771,
      "moves": 772,
      "bitwise": 773,
      "p3": 774,
      "digit": 775,
      "ms": 776,
      "--------+": 777,
      "------------------------+": 778,
      "clear": 779,
      "\"+------------------------+": 780,
      "reverse": 781,
      "num2": 782,
      "flag1": 783,
      "down": 784,
      "\"*": 785,
      "f2": 786,
      "tru": 787,
      "initialize": 788,
      "truth": 789,
      "48": 790,
      "......": 791,
      "..............": 792,
      "comp": 793,
      "\".": 794,
      "Friends": 795,
      "In": 796,
      "cmp": 797,
      "hip": 798,
      "......................": 799,
      "Friendship": 800,
      "fin": 801,
      "letter": 802,
      "2e": 803,
      "ang": 804,
      "truthy": 805,
      ".......................|": 806,
      "l2": 807,
      "position": 808,
      "li": 809,
      "[\"": 810,
      "hed": 811,
      "man": 812,
      "sco": 813,
      "b2": 814,
      "k2": 815,
      "sy": 816,
      "een": 817,
      "betw": 818,
      "ity": 819,
      "'-')": 820,
      "different": 821,
      "between": 822,
      "fre": 823,
      "hedron": 824,
      "500": 825,
      "a3": 826,
      "35": 827,
      "1LL": 828,
      "IM": 829,
      "_gcd": 830,
      "both": 831,
      "\"*\";": 832,
      "22": 833,
      "reading": 834,
      "m1": 835,
      "ist": 836,
      "ish": 837,
      "score": 838,
      "sto": 839,
      "casted": 840,
      "can": 841,
      "orre": 842,
      "\"+------------------------+\"": 843,
      "('": 844,
      "pq": 845,
      "rock": 846,
      "fil": 847,
      "where": 848,
      "ic": 849,
      "space": 850,
      "\"]": 851,
      "SE": 852,
      "bytes": 853,
      "iterator": 854,
      "upper": 855,
      "orrect": 856,
      "25": 857,
      "[]": 858,
      "kol": 859,
      "Pr": 860,
      "has": 861,
      "scis": 862,
      "sors": 863,
      "scissors": 864,
      "++,": 865,
      "count1": 866,
      "temp1": 867,
      "ple": 868,
      "pap": 869,
      "paper": 870,
      "');": 871,
      "pop": 872,
      "vel": 873,
      "color": 874,
      "initialized": 875,
      "Ch": 876,
      "power": 877,
      "ceil": 878,
      "360": 879,
      "fl": 880,
      "tx": 881,
      "temp2": 882,
      "father": 883,
      "NG": 884,
      "ba": 885,
      "oy": 886,
      "m2": 887,
      "fast": 888,
      "cm": 889,
      "'+": 890,
      "r1": 891,
      "Prime": 892,
      "tb": 893,
      "\"\";": 894,
      "fb": 895,
      "\"#\";": 896,
      "ning": 897,
      "min1": 898,
      "beginning": 899,
      "ra": 900,
      "flag2": 901,
      "EN": 902,
      "GM": 903,
      "r2": 904,
      "ream": 905,
      "180": 906,
      "SEGM": 907,
      "ENT": 908,
      "SEGMENT": 909,
      "32": 910,
      "h1": 911,
      "_b": 912,
      "sx": 913,
      "cap": 914,
      "ot": 915,
      "div": 916,
      "shif": 917,
      "::": 918,
      "x3": 919,
      "\"#\"": 920,
      "found": 921,
      "sqr": 922,
      "zz": 923,
      "OOOO": 924,
      "data": 925,
      ")]": 926,
      "Min": 927,
      "__gcd": 928,
      "sk": 929,
      "red": 930,
      "edge": 931,
      "substring": 932,
      "bb": 933,
      "pi": 934,
      "arr2": 935,
      "adj": 936,
      "chest": 937,
      "et": 938,
      "100001": 939,
      "stream": 940,
      "quare": 941,
      "97": 942,
      "'+')": 943,
      "yy": 944,
      "board": 945,
      "#.#.#.#.#.#.": 946,
      "'*')": 947,
      "high": 948,
      "Second": 949,
      "PI": 950,
      "square": 951,
      "},": 952,
      "sqrt": 953,
      "First": 954,
      "ik": 955,
      "inp": 956,
      "acos": 957,
      "cek": 958,
      "best": 959,
      "Col": 960,
      "ited": 961,
      "queue": 962,
      "shift": 963,
      "aj": 964,
      "ci": 965,
      "which": 966,
      "flo": 967,
      "ers": 968,
      "primes": 969,
      "250": 970,
      "1010": 971,
      "bl": 972,
      "fix": 973,
      "OW": 974,
      "he": 975,
      "ANG": 976,
      "TRI": 977,
      "mal": 978,
      "arr1": 979,
      "ANGLE": 980,
      "TRIANGLE": 981,
      "bice": 982,
      "biceps": 983,
      "bu": 984,
      "c_": 985,
      "ho": 986,
      "par": 987,
      "\"\"": 988,
      "14": 989,
      "bs": 990,
      "!\"": 991,
      "DOW": 992,
      "UP": 993,
      "remain": 994,
      "DOWN": 995,
      "jj": 996,
      "vv": 997,
      "ree": 998,
      "_a": 999,
      "sz": 1000,
      "(((": 1001,
      "Of": 1002,
      "SI": 1003,
      "|)\"": 1004,
      "need": 1005,
      "(-": 1006,
      "MIN": 1007,
      "]--;": 1008,
      "cp": 1009,
      "ion": 1010,
      "rat": 1011,
      "isprime": 1012,
      "dep": 1013,
      "tri": 1014,
      ".......................|\"": 1015,
      "jum": 1016,
      "sed": 1017,
      "1e6": 1018,
      "300": 1019,
      "ls": 1020,
      "level": 1021,
      "is_": 1022,
      "PR": 1023,
      "nn": 1024,
      "OOO": 1025,
      "display": 1026,
      "jud": 1027,
      "pri": 1028,
      "plus": 1029,
      "Number": 1030,
      "PRINT": 1031,
      "Arr": 1032,
      "asha": 1033,
      "key": 1034,
      "multipl": 1035,
      ")(": 1036,
      "suma": 1037,
      "ishka": 1038,
      "dim": 1039,
      "'.'": 1040,
      "i2": 1041,
      "kk": 1042,
      "valid": 1043,
      "show": 1044,
      "13": 1045,
      "isPrime": 1046,
      "pass": 1047,
      "ith": 1048,
      "lcm": 1049,
      "i1": 1050,
      "ris": 1051,
      "sm": 1052,
      "]),": 1053,
      "item": 1054,
      "++]": 1055,
      "visited": 1056,
      "fron": 1057,
      "judge": 1058,
      "front": 1059,
      "BLE": 1060,
      "OS": 1061,
      "POS": 1062,
      "IMPOS": 1063,
      "SIBLE": 1064,
      "IMPOSSIBLE": 1065,
      "u1": 1066,
      "u2": 1067,
      "open": 1068,
      "':": 1069,
      "LD": 1070,
      "men": 1071,
      "wo": 1072,
      "root": 1073,
      "'#'": 1074,
      "Re": 1075,
      "h2": 1076,
      "dem": 1077,
      "64_t": 1078,
      "\".\";": 1079,
      "(;": 1080,
      "ai": 1081,
      "int64_t": 1082,
      "iterate": 1083,
      "joy": 1084,
      "sb": 1085,
      "Dan": 1086,
      "ban": 1087,
      "cr": 1088,
      "gap": 1089,
      "init": 1090,
      "points": 1091,
      "freq": 1092,
      "uni": 1093,
      "big": 1094,
      "store": 1095,
      "dir": 1096,
      "uck": 1097,
      "state": 1098,
      "float": 1099,
      "Pos": 1100,
      "used": 1101,
      "txt": 1102,
      "cy": 1103,
      "oo": 1104,
      "multiple": 1105,
      "Po": 1106,
      "TE": 1107,
      "filled": 1108,
      "'?": 1109,
      "FT": 1110,
      "GH": 1111,
      "table": 1112,
      "ton": 1113,
      "med": 1114,
      "ada": 1115,
      "order": 1116,
      "LEFT": 1117,
      "RIGH": 1118,
      "RIGHT": 1119,
      "51": 1120,
      "Correct": 1121,
      "b3": 1122,
      "pts": 1123,
      "|=": 1124,
      "std": 1125,
      "size_t": 1126,
      "PS": 1127,
      "fabs": 1128,
      "ip": 1129,
      "minx": 1130,
      "distan": 1131,
      "grid": 1132,
      "count2": 1133,
      "book": 1134,
      "myset": 1135,
      "multiply": 1136,
      "lim": 1137,
      "rs": 1138,
      "way": 1139,
      "alp": 1140,
      "]]++;": 1141,
      "2000": 1142,
      "ny": 1143,
      "isn": 1144,
      "head": 1145,
      "hel": 1146,
      "acce": 1147,
      "99999999": 1148,
      "'#';": 1149,
      ".\"": 1150,
      "rec": 1151,
      "uel": 1152,
      "unique": 1153,
      "EPS": 1154,
      "pal": 1155,
      "isha": 1156,
      "#.|": 1157,
      "->": 1158,
      "-|": 1159,
      "[(": 1160,
      "der": 1161,
      "hab": 1162,
      "rou": 1163,
      "ori": 1164,
      "res1": 1165,
      "asd": 1166,
      "_n": 1167,
      "tc": 1168,
      "coun": 1169,
      "lol": 1170,
      "tmp2": 1171,
      "days": 1172,
      "200005": 1173,
      "fur": 1174,
      "rows": 1175,
      "further": 1176,
      "AM": 1177,
      "#.#.#.#.#.#.#.#.#.#.": 1178,
      "match": 1179,
      "blue": 1180,
      "TEAM": 1181,
      ">::": 1182,
      "WIN": 1183,
      "ref": 1184,
      "sec": 1185,
      "tem": 1186,
      "min2": 1187,
      "tive": 1188,
      "counts": 1189,
      "WINS": 1190,
      "af": 1191,
      "mon": 1192,
      "nce": 1193,
      "s4": 1194,
      "ut": 1195,
      "log": 1196,
      "100010": 1197,
      "Color": 1198,
      "accepts": 1199,
      "fuel": 1200,
      "tab": 1201,
      "umn": 1202,
      "tra": 1203,
      "asya": 1204,
      "precis": 1205,
      "case": 1206,
      "precision": 1207,
      "ec": 1208,
      "gu": 1209,
      "visit": 1210,
      "type": 1211,
      ".#.#.": 1212,
      "435": 1213,
      "824": 1214,
      "c3": 1215,
      "hm": 1216,
      "ie": 1217,
      "pp": 1218,
      "{}": 1219,
      "ort": 1220,
      "clo": 1221,
      "99824": 1222,
      ".#.#.#.#.#.#.": 1223,
      ".#.#.#.#.#.#.#.#.": 1224,
      "edges": 1225,
      "4353": 1226,
      "998244353": 1227,
      "'(": 1228,
      "Sum": 1229,
      "_x": 1230,
      "cn": 1231,
      "tp": 1232,
      "ted": 1233,
      "resp": 1234,
      "ild": 1235,
      "Ak": 1236,
      "hh": 1237,
      "reen": 1238,
      "sion": 1239,
      "exp": 1240,
      "point": 1241,
      "shat": 1242,
      "\".\"": 1243,
      "Akshat": 1244,
      "'('": 1245,
      "mag": 1246,
      ";;": 1247,
      "list": 1248,
      "nums": 1249,
      "divis": 1250,
      "1000000000": 1251,
      "oud": 1252,
      "child": 1253,
      "num_": 1254,
      "2e9": 1255,
      "Ehab": 1256,
      "Mal": 1257,
      "Mishka": 1258,
      "dd": 1259,
      "tar": 1260,
      "ension": 1261,
      "1000000009": 1262,
      "vika": 1263,
      "bitshift": 1264,
      "Mahm": 1265,
      "'*';": 1266,
      "Chris": 1267,
      "remainder": 1268,
      "dimension": 1269,
      "woman": 1270,
      "Malvika": 1271,
      "Mahmoud": 1272,
      "S1": 1273,
      "tim": 1274,
      "chars": 1275,
      "gets": 1276,
      "fathercnt": 1277,
      "magic": 1278,
      "BW": 1279,
      "^^": 1280,
      "ner": 1281,
      "!^^": 1282,
      "120": 1283,
      "27": 1284,
      "na": 1285,
      "--,": 1286,
      "starting": 1287,
      "Power": 1288,
      "ei": 1289,
      "rl": 1290,
      "|)": 1291,
      "stat": 1292,
      "off": 1293,
      "sum3": 1294,
      "tain": 1295,
      "201": 1296,
      "eps": 1297,
      "captain": 1298,
      "ER": 1299,
      "Le": 1300,
      "RU": 1301,
      "correct": 1302,
      "isa": 1303,
      "2e5": 1304,
      "fill": 1305,
      "hash": 1306,
      "cup": 1307,
      "gg": 1308,
      "lice": 1309,
      "ung": 1310,
      "200000": 1311,
      "skip": 1312,
      "'(')": 1313,
      "_y": 1314,
      "mult": 1315,
      "{\"": 1316,
      "endline": 1317,
      "minus": 1318,
      "'.')": 1319,
      "UR": 1320,
      "matri": 1321,
      "102": 1322,
      "infin": 1323,
      "items": 1324,
      "Ans": 1325,
      "home": 1326,
      "sie": 1327,
      "lock": 1328,
      "decremented": 1329,
      "1e18": 1330,
      "column": 1331,
      "oul": 1332,
      "tate": 1333,
      "1000005": 1334,
      "'.';": 1335,
      "\"?": 1336,
      "IT": 1337,
      "Sp": 1338,
      "s_": 1339,
      "comm": 1340,
      "using": 1341,
      "LU": 1342,
      "RD": 1343,
      "T1": 1344,
      "game": 1345,
      "green": 1346,
      "nor": 1347,
      "wor": 1348,
      "reg": 1349,
      "pos1": 1350,
      "2005": 1351,
      "mymap": 1352,
      "good": 1353,
      "Anton": 1354,
      "ain": 1355,
      "dr": 1356,
      "sing": 1357,
      "ous": 1358,
      ">>=": 1359,
      "sil": 1360,
      "mas": 1361,
      "hate": 1362,
      "compare": 1363,
      "Danik": 1364,
      "sieve": 1365,
      "br": 1366,
      "brr": 1367,
      "cs": 1368,
      "cw": 1369,
      "hit": 1370,
      "max2": 1371,
      "ress": 1372,
      "asc": 1373,
      "ones": 1374,
      "month": 1375,
      "Do": 1376,
      "]])": 1377,
      "ye": 1378,
      "ons": 1379,
      "lack": 1380,
      "\"|#.#.#.#.#.#.#.#.#.#.": 1381,
      "RE": 1382,
      "eed": 1383,
      "pol": 1384,
      "unt": 1385,
      "alt": 1386,
      "min3": 1387,
      "gest": 1388,
      "contain": 1389,
      "#.|.|)\"": 1390,
      "whichPos": 1391,
      "distance": 1392,
      "whichPosn": 1393,
      "Mind": 1394,
      "Soul": 1395,
      "]][": 1396,
      "ation": 1397,
      "card": 1398,
      "est": 1399,
      "sc": 1400,
      "three": 1401,
      "ality": 1402,
      "dest": 1403,
      "winner": 1404,
      "Reality": 1405,
      "dimensional": 1406,
      "Space": 1407,
      "28": 1408,
      "OR": 1409,
      "Str": 1410,
      "tm": 1411,
      "ys": 1412,
      "res2": 1413,
      "ccw": 1414,
      "prog": 1415,
      "Incorrect": 1416,
      "_max": 1417,
      "pt": 1418,
      "keyboard": 1419,
      "infinite": 1420,
      "65": 1421,
      "AT": 1422,
      "CH": 1423,
      "GNO": 1424,
      "HIM": 1425,
      "HER": 1426,
      "IGNO": 1427,
      "Misha": 1428,
      "Vasya": 1429,
      "WIT": 1430,
      "ak": 1431,
      "thing": 1432,
      "sumb": 1433,
      "sizes": 1434,
      "sup": 1435,
      "marks": 1436,
      "file": 1437,
      "cpy": 1438,
      "CHAT": 1439,
      "IGNORE": 1440,
      "WITH": 1441,
      ";)": 1442,
      "aur": 1443,
      "nu": 1444,
      "w2": 1445,
      "tolower": 1446,
      "exist": 1447,
      "looping": 1448,
      "shu": 1449,
      "999": 1450,
      "Set": 1451,
      "_1": 1452,
      "_pair": 1453,
      "pur": 1454,
      "ting": 1455,
      "sent": 1456,
      "ary": 1457,
      "make_pair": 1458,
      "1111": 1459,
      "'#')": 1460,
      "40": 1461,
      "ag": 1462,
      "bil": 1463,
      "block": 1464,
      "ctr": 1465,
      "ql": 1466,
      "va": 1467,
      "vs": 1468,
      "w1": 1469,
      "ch1": 1470,
      "team": 1471,
      "pos2": 1472,
      "statement": 1473,
      "work": 1474,
      "How": 1475,
      "Kare": 1476,
      "Pen": 1477,
      "[],": 1478,
      "turn": 1479,
      "req": 1480,
      "ority": 1481,
      "ister": 1482,
      "sum_": 1483,
      "lah": 1484,
      "mode": 1485,
      "lessons": 1486,
      "tmp1": 1487,
      "starty": 1488,
      "light": 1489,
      "flg": 1490,
      "jumlah": 1491,
      "priority": 1492,
      "register": 1493,
      "Howard": 1494,
      "Karen": 1495,
      "Penny": 1496,
      "S2": 1497,
      "ds": 1498,
      "ly": 1499,
      "vb": 1500,
      "wel": 1501,
      "xs": 1502,
      "throu": 1503,
      "maxm": 1504,
      "come": 1505,
      "vowel": 1506,
      "123": 1507,
      "yak": 1508,
      "ucky": 1509,
      "33": 1510,
      "864": 1511,
      "Oh": 1512,
      "Raj": 1513,
      "Shel": 1514,
      "Tie": 1515,
      "don": 1516,
      "esh": 1517,
      "gro": 1518,
      "kl": 1519,
      "onard": 1520,
      "become": 1521,
      "its": 1522,
      "10000000": 1523,
      "#.|.|\"": 1524,
      "stdout": 1525,
      "alpha": 1526,
      "guy": 1527,
      "Leonard": 1528,
      "\"?\"": 1529,
      "through": 1530,
      "86400": 1531,
      "Rajesh": 1532,
      "Sheldon": 1533,
      ").": 1534,
      "Ro": 1535,
      "UT": 1536,
      "Whi": 1537,
      "bin": 1538,
      "md": 1539,
      "ob": 1540,
      "same": 1541,
      "000": 1542,
      "minate": 1543,
      "startx": 1544,
      "numbers": 1545,
      "hitung": 1546,
      "ig": 1547,
      "lt": 1548,
      "ni": 1549,
      "pla": 1550,
      "orange": 1551,
      "strcmp": 1552,
      "vectors": 1553,
      "erence": 1554,
      "stone": 1555,
      "reference": 1556,
      "poly": 1557,
      "purple": 1558,
      "place": 1559,
      "\"#.": 1560,
      "(!(": 1561,
      "'['": 1562,
      "16": 1563,
      "Black": 1564,
      "TS": 1565,
      "TES": 1566,
      "yel": 1567,
      "ch2": 1568,
      "creasing": 1569,
      "cot": 1570,
      "oney": 1571,
      "diag": 1572,
      "zzzz": 1573,
      "banyak": 1574,
      "command": 1575,
      "White": 1576,
      "TESTS": 1577,
      "yellow": 1578,
      ",\"": 1579,
      "Dasha": 1580,
      "Masha": 1581,
      "XX": 1582,
      "[++": 1583,
      "_min": 1584,
      "ao": 1585,
      "ast": 1586,
      "pw": 1587,
      "so": 1588,
      "seq": 1589,
      "loc": 1590,
      ")))": 1591,
      "501": 1592,
      "lar": 1593,
      "nx": 1594,
      "wei": 1595,
      "stack": 1596,
      "setting": 1597,
      "mina": 1598,
      "]));": 1599,
      "nothing": 1600,
      "min_i": 1601,
      "min_j": 1602,
      "fixed": 1603,
      "after": 1604,
      "BWBW": 1605,
      "Oc": 1606,
      "Sol": 1607,
      "_start": 1608,
      "ax": 1609,
      "gan": 1610,
      "imax": 1611,
      "action": 1612,
      "does": 1613,
      "curlower": 1614,
      "udmoves": 1615,
      "rlmoves": 1616,
      "until": 1617,
      "\"};": 1618,
      "jil": 1619,
      "t3": 1620,
      "ube": 1621,
      "side": 1622,
      "ending": 1623,
      "love": 1624,
      "max_i": 1625,
      "max_j": 1626,
      "240": 1627,
      "status": 1628,
      "ganjil": 1629,
      "90": 1630,
      "fac": 1631,
      "hang": 1632,
      "q1": 1633,
      "err": 1634,
      "tam": 1635,
      "INT_MIN": 1636,
      "grap": 1637,
      "players": 1638,
      "Co": 1639,
      "bt": 1640,
      "bus": 1641,
      "hu": 1642,
      "ln": 1643,
      "num3": 1644,
      "10005": 1645,
      "spf": 1646,
      "goto": 1647,
      "|.|\"": 1648,
      ".#.#.#.#.#.#.#.#.#.#.": 1649,
      "divided": 1650,
      "':')": 1651,
      "columns": 1652,
      "graph": 1653,
      "\"/": 1654,
      "PH": 1655,
      "hal": 1656,
      "ves": 1657,
      "'))": 1658,
      "address": 1659,
      "content": 1660,
      "booleans": 1661,
      "2001": 1662,
      "Equal": 1663,
      "_sum": 1664,
      "deg": 1665,
      "ee": 1666,
      "money": 1667,
      "form": 1668,
      "ded": 1669,
      "00000": 1670,
      "ffff": 1671,
      "biao": 1672,
      "letters": 1673,
      "\"/\"": 1674,
      "']++;": 1675,
      "P1": 1676,
      "T2": 1677,
      "itr": 1678,
      "pas": 1679,
      "resize": 1680,
      "our": 1681,
      "del": 1682,
      "putchar": 1683,
      "year": 1684,
      "96": 1685,
      "Alice": 1686,
      "MX": 1687,
      "du": 1688,
      "wri": 1689,
      "deca": 1690,
      "box": 1691,
      "ador": 1692,
      "keep": 1693,
      "tahedron": 1694,
      "trahedron": 1695,
      "decahedron": 1696,
      "!(": 1697,
      "AQ": 1698,
      "Bob": 1699,
      "Ter": 1700,
      "_ans": 1701,
      "sel": 1702,
      "sta": 1703,
      "mak": 1704,
      "sumr": 1705,
      "dp0": 1706,
      "calc": 1707,
      "present": 1708,
      "Terminate": 1709,
      "BB": 1710,
      "Cube": 1711,
      "Te": 1712,
      "]];": 1713,
      "den": 1714,
      "jkl": 1715,
      "ki": 1716,
      "was": 1717,
      "hi2": 1718,
      "maxs": 1719,
      "lena": 1720,
      "00000000": 1721,
      "ulb": 1722,
      "mxm": 1723,
      "159": 1724,
      "goal": 1725,
      "|.|)\"": 1726,
      "buff": 1727,
      "14159": 1728,
      "ascending": 1729,
      "Dodecahedron": 1730,
      "Roz": 1731,
      "Octahedron": 1732,
      "Tetrahedron": 1733,
      "wea": 1734,
      "{};": 1735,
      "dp1": 1736,
      "angle": 1737,
      "3e": 1738,
      "IE": 1739,
      "To": 1740,
      "TIE": 1741,
      "dc": 1742,
      "mpar": 1743,
      "lenb": 1744,
      "calling": 1745,
      "freopen": 1746,
      "cry": 1747,
      "'?'": 1748,
      "!^^\"": 1749,
      "half": 1750,
      "Mo": 1751,
      "Row": 1752,
      "_queue": 1753,
      "n_": 1754,
      "cho": 1755,
      "stringstream": 1756,
      "defined": 1757,
      "Input": 1758,
      "priority_queue": 1759,
      "Int": 1760,
      "S3": 1761,
      "Too": 1762,
      "UL": 1763,
      "non": 1764,
      "oban": 1765,
      "ure": 1766,
      "zx": 1767,
      "counting": 1768,
      "1e3": 1769,
      "subtraction": 1770,
      "amount": 1771,
      "3000": 1772,
      "clock": 1773,
      "contents": 1774,
      "write": 1775,
      "weak": 1776,
      "\"),": 1777,
      "80": 1778,
      "cop": 1779,
      "fx": 1780,
      "lucky": 1781,
      "xor": 1782,
      "summ": 1783,
      "maxy": 1784,
      "total_": 1785,
      "weight": 1786,
      "'^": 1787,
      "220": 1788,
      "400": 1789,
      "Con": 1790,
      "RA": 1791,
      "_2": 1792,
      "dg": 1793,
      "rx": 1794,
      "max3": 1795,
      "contest": 1796,
      "dos": 1797,
      "cosa": 1798,
      "first_": 1799,
      "previ": 1800,
      "page": 1801,
      "proce": 1802,
      "depth": 1803,
      "is_prime": 1804,
      "cosahedron": 1805,
      "previous": 1806,
      "fy": 1807,
      "tu": 1808,
      "tstep": 1809,
      "xt": 1810,
      "yes": 1811,
      "ank": 1812,
      "sumc": 1813,
      "maxN": 1814,
      "rotate": 1815,
      "bot": 1816,
      "votes": 1817,
      "cake": 1818,
      "aux2": 1819,
      "CD": 1820,
      "GRA": 1821,
      "GCD": 1822,
      "Icosahedron": 1823,
      "OT": 1824,
      "_str": 1825,
      "j1": 1826,
      "oven": 1827,
      "reset": 1828,
      "undefined": 1829,
      "')')": 1830,
      "dot": 1831,
      "soroban": 1832,
      "chess": 1833,
      "vert": 1834,
      "words": 1835,
      "#.|.|)": 1836,
      "GRAPH": 1837,
      "'}": 1838,
      "fal": 1839,
      "lca": 1840,
      "uce": 1841,
      "cell": 1842,
      "indrom": 1843,
      "aux1": 1844,
      "final": 1845,
      "bak": 1846,
      "150": 1847,
      "DL": 1848,
      "LC": 1849,
      "Ops": 1850,
      "PUT": 1851,
      "ULL": 1852,
      "fe": 1853,
      "mer": 1854,
      "mishka": 1855,
      "pb": 1856,
      "sd": 1857,
      "ui": 1858,
      "v3": 1859,
      "wt": 1860,
      "eros": 1861,
      "numOps": 1862,
      "com": 1863,
      "prices": 1864,
      "cycle": 1865,
      "'<": 1866,
      ".\";": 1867,
      "29": 1868,
      "47": 1869,
      "Next": 1870,
      "P2": 1871,
      "_size": 1872,
      "cx": 1873,
      "cand": 1874,
      "cil": 1875,
      "nm": 1876,
      "smal": 1877,
      "wa": 1878,
      "old": 1879,
      "205": 1880,
      "1000001": 1881,
      "menor": 1882,
      "smalle": 1883,
      "Found": 1884,
      "Len": 1885,
      "Size": 1886,
      "ULD": 1887,
      "bfs": 1888,
      "cad": 1889,
      "cvb": 1890,
      "fgh": 1891,
      "n3": 1892,
      "pd": 1893,
      "rt": 1894,
      "invo": 1895,
      "anak": 1896,
      "beat": 1897,
      "till": 1898,
      "numOf": 1899,
      "ope": 1900,
      "more": 1901,
      "arg1": 1902,
      "colo": 1903,
      "111": 1904,
      "speed": 1905,
      "reduce": 1906,
      "200010": 1907,
      "divisor": 1908,
      "matrix": 1909,
      "zxcvb": 1910,
      "ULDR": 1911,
      "fghjkl": 1912,
      "invoke": 1913,
      "anako": 1914,
      "zxcvbnm": 1915,
      "'[": 1916,
      "Va": 1917,
      "_s": 1918,
      "fo": 1919,
      "imin": 1920,
      "ji": 1921,
      "mmin": 1922,
      "yt": 1923,
      "seg": 1924,
      "args": 1925,
      "coin": 1926,
      "dier": 1927,
      "122": 1928,
      "diff2": 1929,
      "have": 1930,
      "numberOf": 1931,
      "':'": 1932,
      ",.": 1933,
      "Ci": 1934,
      "GOT": 1935,
      "_count": 1936,
      "b_": 1937,
      "cti": 1938,
      "fing": 1939,
      "kan": 1940,
      "o1": 1941,
      "qwer": 1942,
      "xay": 1943,
      "z1": 1944,
      "ink": 1945,
      "rep": 1946,
      "togg": 1947,
      "strcpy": 1948,
      "]]]": 1949,
      "diff1": 1950,
      "find_": 1951,
      "tyui": 1952,
      "spec": 1953,
      "bits": 1954,
      "asdfghjkl": 1955,
      "matriz": 1956,
      "drink": 1957,
      "proceed": 1958,
      "Ciel": 1959,
      "GOTO": 1960,
      "fingers": 1961,
      "qwertyui": 1962,
      "toggle": 1963,
      "qwertyuiop": 1964,
      "^=": 1965,
      "av": 1966,
      "mmax": 1967,
      "neg": 1968,
      "o2": 1969,
      "qq": 1970,
      "ry": 1971,
      "t0": 1972,
      "{'": 1973,
      "may": 1974,
      "str3": 1975,
      "mp1": 1976,
      "respe": 1977,
      "nore": 1978,
      "acum": 1979,
      "')'": 1980,
      "post": 1981,
      "505": 1982,
      "buf": 1983,
      "limit": 1984,
      "silisa": 1985,
      "ignore": 1986,
      "\"#.\";": 1987,
      "copy": 1988,
      "Vasilisa": 1989,
      "respecti": 1990,
      "(*": 1991,
      "0LL": 1992,
      "1ll": 1993,
      "DR": 1994,
      "Hanako": 1995,
      "Nik": 1996,
      "Ol": 1997,
      "Pic": 1998,
      "Sort": 1999,
      "Still": 2000,
      "_time": 2001,
      "cas": 2002,
      "lc": 2003,
      "ome": 2004,
      "vl": 2005,
      "y3": 2006,
      "isdigit": 2007,
      "ash": 2008,
      "ita": 2009,
      "aten": 2010,
      "short": 2011,
      "code": 2012,
      "cur_": 2013,
      "dil": 2014,
      "time2": 2015,
      "\"|.|": 2016,
      "200001": 2017,
      "Danil": 2018,
      "'?')": 2019,
      "record": 2020,
      "1415926": 2021,
      "Rozdil": 2022,
      "crypt": 2023,
      "Nikita": 2024,
      "Olya": 2025,
      "Mod": 2026,
      "P3": 2027,
      "QAQ": 2028,
      "a_": 2029,
      "bk": 2030,
      "carr": 2031,
      "ct1": 2032,
      "hor": 2033,
      "lab": 2034,
      "wal": 2035,
      "{-": 2036,
      "to_": 2037,
      "tom": 2038,
      "iso": 2039,
      "arg2": 2040,
      "time1": 2041,
      "1000006": 2042,
      "player": 2043,
      "vely": 2044,
      "stdin": 2045,
      "indrome": 2046,
      "candid": 2047,
      "respectively": 2048,
      "68": 2049,
      "FS": 2050,
      "ONG": 2051,
      "Sla": 2052,
      "Zeros": 2053,
      "_p": 2054,
      "bal": 2055,
      "ger": 2056,
      "jw": 2057,
      "round": 2058,
      "tree": 2059,
      "stu": 2060,
      "exc": 2061,
      "chris": 2062,
      "ays": 2063,
      "ants": 2064,
      "mnm": 2065,
      "hasil": 2066,
      "steps": 2067,
      "max_element": 2068,
      "Ann": 2069,
      "cmd": 2070,
      "raw": 2071,
      "floor": 2072,
      "remaining": 2073,
      "levels": 2074,
      "aurants": 2075,
      "bills": 2076,
      "colom": 2077,
      "ONG_": 2078,
      "Slava": 2079,
      "'][": 2080,
      "Cr": 2081,
      "a4": 2082,
      "ct2": 2083,
      "nCr": 2084,
      "plen": 2085,
      "rta": 2086,
      "xf": 2087,
      "toupper": 2088,
      "crew": 2089,
      "sumz": 2090,
      "maxa": 2091,
      "numb": 2092,
      "sign_": 2093,
      "kecil": 2094,
      "MAX_": 2095,
      "answers": 2096,
      "save": 2097,
      "primo": 2098,
      "999999999": 2099,
      "bottom": 2100,
      "17": 2101,
      "23": 2102,
      "67": 2103,
      "CUR": 2104,
      "End": 2105,
      "c0": 2106,
      "done": 2107,
      "e_": 2108,
      "ns": 2109,
      "pare": 2110,
      "xy": 2111,
      "yf": 2112,
      "zation": 2113,
      "ours": 2114,
      "ara2": 2115,
      "node": 2116,
      "active": 2117,
      "1000010": 2118,
      "pref": 2119,
      "interval": 2120,
      "max_n": 2121,
      "finish": 2122,
      "ajout": 2123,
      "Number2": 2124,
      "password": 2125,
      "ways": 2126,
      "gesture": 2127,
      "Solve": 2128,
      "subtractions_": 2129,
      "qwertyuiopasdfghjkl": 2130,
      "carry": 2131,
      "parent": 2132,
      "30000": 2133,
      "Bulb": 2134,
      "State": 2135,
      "gi": 2136,
      "kt": 2137,
      "mx1": 2138,
      "salt": 2139,
      "xsum": 2140,
      "isgro": 2141,
      "arch": 2142,
      "vest": 2143,
      "()),": 2144,
      "sumA": 2145,
      "cntr": 2146,
      "asaur": 2147,
      "shel": 2148,
      ")));": 2149,
      "riba": 2150,
      "128": 2151,
      "999999": 2152,
      "positive": 2153,
      "5000": 2154,
      "dep_": 2155,
      "factor": 2156,
      "cakes": 2157,
      "falsy": 2158,
      "'[')": 2159,
      "kanan": 2160,
      "Bulbasaur": 2161,
      ")];": 2162,
      "535": 2163,
      "Joy": 2164,
      "Need": 2165,
      "Temp": 2166,
      "dsa": 2167,
      "fr": 2168,
      "io": 2169,
      "lin": 2170,
      "mu": 2171,
      "pv": 2172,
      "une": 2173,
      "ysum": 2174,
      "isV": 2175,
      "loss": 2176,
      "counta": 2177,
      ")),": 2178,
      "contador": 2179,
      "names": 2180,
      "9999999": 2181,
      "305": 2182,
      "Che": 2183,
      "Number1": 2184,
      "distanc": 2185,
      "largest": 2186,
      "1415926535": 2187,
      "uneven": 2188,
      "\"\",": 2189,
      "De": 2190,
      "Map": 2191,
      "ica": 2192,
      "nb": 2193,
      "ng": 2194,
      "om": 2195,
      "tmo": 2196,
      "increasing": 2197,
      "ance": 2198,
      "this": 2199,
      "ar1": 2200,
      "returned": 2201,
      "deci": 2202,
      "cha": 2203,
      "tels": 2204,
      "modul": 2205,
      "ats": 2206,
      "000000": 2207,
      "ant2": 2208,
      "Counter": 2209,
      "c_str": 2210,
      "hotels": 2211,
      "stati": 2212,
      "candidate": 2213,
      "decimal": 2214,
      "**": 2215,
      "600": 2216,
      "70": 2217,
      "AN": 2218,
      "G1": 2219,
      "Home": 2220,
      "MN": 2221,
      "bul": 2222,
      "da": 2223,
      "f3": 2224,
      "ju": 2225,
      "lst": 2226,
      "lsum": 2227,
      "misha": 2228,
      "q2": 2229,
      "s0": 2230,
      "sl": 2231,
      "yke": 2232,
      "{},": 2233,
      "lef": 2234,
      "arm": 2235,
      "ans3": 2236,
      "als": 2237,
      "endx": 2238,
      "endy": 2239,
      "arra": 2240,
      "chr": 2241,
      "sumy": 2242,
      "size_n": 2243,
      "lose": 2244,
      "qua": 2245,
      "lens": 2246,
      "numer": 2247,
      "pole": 2248,
      "1e8": 2249,
      "2002": 2250,
      "spyke": 2251,
      "fff": 2252,
      "5001": 2253,
      "5005": 2254,
      "Char": 2255,
      "palin": 2256,
      "'>": 2257,
      ")((": 2258,
      "52": 2259,
      "Let": 2260,
      "Oven": 2261,
      "cn1": 2262,
      "ev": 2263,
      "ever": 2264,
      "frest": 2265,
      "nex": 2266,
      "sn": 2267,
      "uter": 2268,
      "yu": 2269,
      "mall": 2270,
      "()],": 2271,
      "decreasing": 2272,
      "sumx": 2273,
      "cnta": 2274,
      "bob": 2275,
      "indx": 2276,
      "righ": 2277,
      "progr": 2278,
      "computer": 2279,
      "palindrome": 2280,
      "String": 2281,
      "binary": 2282,
      "nonzero": 2283,
      "coins": 2284,
      "210": 2285,
      "5e": 2286,
      "88": 2287,
      "DFS": 2288,
      "Find": 2289,
      "Pre": 2290,
      "_la": 2291,
      "bisa": 2292,
      "dt": 2293,
      "hur": 2294,
      "lr": 2295,
      "nded": 2296,
      "qta": 2297,
      "qtb": 2298,
      "rc": 2299,
      "sat": 2300,
      "xmax": 2301,
      "erate": 2302,
      "chang": 2303,
      "suml": 2304,
      "loca": 2305,
      "103": 2306,
      "miny": 2307,
      "she": 2308,
      "shap": 2309,
      "1e2": 2310,
      "mxv": 2311,
      "\"|#": 2312,
      "gov": 2313,
      "inlined": 2314,
      "rati": 2315,
      "_a_la": 2316,
      "rounded": 2317,
      "games": 2318,
      "contains": 2319,
      "numa": 2320,
      "stones": 2321,
      "dos_a_la": 2322,
      "modulus": 2323,
      "satu": 2324,
      "changing": 2325,
      "34": 2326,
      "45": 2327,
      "Ex": 2328,
      "Go": 2329,
      "mk": 2330,
      "tp1": 2331,
      "inc": 2332,
      "inv": 2333,
      "search": 2334,
      "sible": 2335,
      "desk": 2336,
      "loct": 2337,
      "conti": 2338,
      "mov": 2339,
      "tempm": 2340,
      "tation": 2341,
      "possible": 2342,
      "maxi2": 2343,
      "letter_start": 2344,
      "fast_": 2345,
      "guous": 2346,
      "num_start": 2347,
      "containing": 2348,
      "deno": 2349,
      "3e5": 2350,
      "every": 2351,
      "contiguous": 2352,
      "'!": 2353,
      "'};": 2354,
      "214": 2355,
      "364": 2356,
      "748": 2357,
      "Cnt": 2358,
      "It": 2359,
      "Koy": 2360,
      "Pow": 2361,
      "Qr": 2362,
      "VI": 2363,
      "Val": 2364,
      "_op": 2365,
      "four": 2366,
      "hb": 2367,
      "n0": 2368,
      "nc": 2369,
      "nr": 2370,
      "omi": 2371,
      "sal": 2372,
      "ses": 2373,
      "st2": 2374,
      "mask": 2375,
      "exec": 2376,
      "sumd": 2377,
      "maxlen": 2378,
      "mp2": 2379,
      "res_": 2380,
      "tot1": 2381,
      "tot2": 2382,
      "getInt": 2383,
      "soldier": 2384,
      "\"|\";": 2385,
      "|.|)": 2386,
      "data2": 2387,
      "amt": 2388,
      "sag": 2389,
      "restaurants": 2390,
      "-|-": 2391,
      "1000000009LL": 2392,
      "normal": 2393,
      "biaoj": 2394,
      "ONG_MAX": 2395,
      "Letter": 2396,
      "214748": 2397,
      "Koyomi": 2398,
      "Value": 2399,
      "214748364": 2400,
      ">(": 2401,
      ">());": 2402,
      "Out": 2403,
      "criba": 2404,
      "dth": 2405,
      "ive": 2406,
      "kat": 2407,
      "tone": 2408,
      "isp": 2409,
      "ume": 2410,
      "()));": 2411,
      "width": 2412,
      "exe_": 2413,
      "incremented": 2414,
      "ters": 2415,
      "acc": 2416,
      "100002": 2417,
      "su2": 2418,
      "prefix": 2419,
      "usa": 2420,
      "maxi1": 2421,
      "lowercase": 2422,
      "min_element": 2423,
      "'*'": 2424,
      "lie": 2425,
      "dua": 2426,
      "label": 2427,
      "MAX_N": 2428,
      "19": 2429,
      "Hash": 2430,
      "_f": 2431,
      "cb": 2432,
      "fact": 2433,
      "gen": 2434,
      "hj": 2435,
      "kq": 2436,
      "lz": 2437,
      "mint": 2438,
      "npos": 2439,
      "pen": 2440,
      "pack": 2441,
      "wen": 2442,
      "toi": 2443,
      "send": 2444,
      "lea": 2445,
      "thod": 2446,
      "vet": 2447,
      "chat": 2448,
      "sumB": 2449,
      "sums": 2450,
      "sum_b": 2451,
      "tical": 2452,
      "ties": 2453,
      "numver": 2454,
      "method": 2455,
      "pot": 2456,
      "ado": 2457,
      "calc_": 2458,
      "mx2": 2459,
      "mn1": 2460,
      "checker": 2461,
      "plica": 2462,
      "INF_": 2463,
      "1000000007LL": 2464,
      "xxx": 2465,
      "test1": 2466,
      "'-';": 2467,
      "difference": 2468,
      "_bound": 2469,
      "ciones": 2470,
      "hello": 2471,
      "nuts": 2472,
      "minator": 2473,
      "Moves": 2474,
      "Contest": 2475,
      "merge": 2476,
      "given": 2477,
      "ANS": 2478,
      "lzl": 2479,
      "Cmp": 2480,
      "Win": 2481,
      "atoi": 2482,
      "fg": 2483,
      "har": 2484,
      "iro": 2485,
      "ias": 2486,
      "jth": 2487,
      "jav": 2488,
      "qmarks": 2489,
      "tdiff": 2490,
      "des": 2491,
      "maxl": 2492,
      "len2": 2493,
      "tempn": 2494,
      "acterias": 2495,
      "mn2": 2496,
      "index1": 2497,
      "finall": 2498,
      "colors": 2499,
      "squared": 2500,
      "multipli": 2501,
      "workTime": 2502,
      "locg": 2503,
      "1100": 2504,
      "44": 2505,
      "Star": 2506,
      "Way": 2507,
      "_c": 2508,
      "dan": 2509,
      "f_a": 2510,
